# Views Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IViewSheetSet..::..Views Property
IViewSheetSet Interface See Also
---
The views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
ViewSet Views { get; set; }
```

Visual Basic
---
```text
Property Views As ViewSet
	Get
	Set
```

Visual C++
---
```text
property ViewSet^ Views {
	ViewSet^ get ();
	void set (ViewSet^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input views is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the set operation failed due to invalid view which cannot be printed. |

# See Also
IViewSheetSet Interface
Autodesk.Revit.DB Namespace